**Importación de librerias**

In [1]:
import pandas as pd
import numpy as np

# Visualización
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns

# Evaluar linealidad de las relaciones entre las variables
# y la distribución de las variables
# ------------------------------------------------------------------------------
#from scipy.stats import shapiro, kstest, poisson, chisquare, ttest_ind, levene, bartlett, sem, ppf
import scipy.stats as stats
from scipy.stats import shapiro, levene
from scipy.stats import ttest_ind
from scipy.stats import mannwhitneyu
from scipy.stats import chi2_contingency

# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Gestión de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

**Fase 1: Exploración y Limpieza**

In [2]:
df_activity = pd.read_csv("../files/Customer Flight Activity.csv") #index_col = 0
df_history = pd.read_csv("../files/Customer Loyalty History.csv") #index_col = 0

In [3]:
df_activity.head() #sacamos las primeras filas del df

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [4]:
df_activity.tail() #para sacar las últimas filas del df

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
405619,999902,2018,12,0,0,0,0,0.0,0,0
405620,999911,2018,12,0,0,0,0,0.0,0,0
405621,999940,2018,12,3,0,3,1233,123.0,0,0
405622,999982,2018,12,0,0,0,0,0.0,0,0
405623,999986,2018,12,0,0,0,0,0.0,0,0

In [5]:
df_activity.shape #para ver la forma del df

(405624, 10)

In [6]:
#Podemos ver que en este df el número de valores no nulos y los typos de datos de cada columna

df_activity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB

In [7]:
df_activity.isnull().sum()

Loyalty Number                 0
Year                           0
Month                          0
Flights Booked                 0
Flights with Companions        0
Total Flights                  0
Distance                       0
Points Accumulated             0
Points Redeemed                0
Dollar Cost Points Redeemed    0
dtype: int64

In [8]:
df_activity.columns

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed'],
      dtype='object')

In [9]:
# Creamos un diccionario para cambiar los nombres de las columnas 
# Usamos replace e iteramos por cada columna del df  
change_names_activity = {col:col.lower().replace(' ', '_') for col in df_activity.columns}
change_names_activity

{'Loyalty Number': 'loyalty_number',
 'Year': 'year',
 'Month': 'month',
 'Flights Booked': 'flights_booked',
 'Flights with Companions': 'flights_with_companions',
 'Total Flights': 'total_flights',
 'Distance': 'distance',
 'Points Accumulated': 'points_accumulated',
 'Points Redeemed': 'points_redeemed',
 'Dollar Cost Points Redeemed': 'dollar_cost_points_redeemed'}

In [10]:
# Con el método rename renombramos las columnas usando los diccionarios creados previamente
df_activity.rename(columns = change_names_activity, inplace = True)

In [11]:
df_activity.head()

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [12]:
df_activity.duplicated().sum()

np.int64(1864)

In [13]:
#Usamos .duplicated para ver las filas duplicadas en el df y filtramos para ver solo las columnas duplicadas en base a Loyalty Number
# Sort_values ordena el resultado 

df_activity[df_activity.duplicated(subset="loyalty_number", keep=False)].sort_values(by="loyalty_number")

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
257159,100018,2018,3,7,0,7,1876,280.5,0,0
257382,100018,2018,2,6,0,6,1824,273.0,0,0
321119,100018,2018,8,0,0,0,0,0.0,0,0
185911,100018,2017,12,6,0,6,1908,190.0,0,0
270416,100018,2018,5,0,0,0,0,0.0,0,0
...,...,...,...,...,...,...,...,...,...,...
118306,999986,2017,7,0,0,0,0,0.0,0,0
140741,999986,2018,8,8,1,9,3672,367.0,655,53
50702,999986,2017,3,13,3,16,3856,385.0,0,0
33801,999986,2017,2,7,0,7,3017,301.0,0,0
16900,999986,2017,1,1,0,1,1849,184.0,0,0

In [14]:
# Eliminados duplicados con .drop_duplicates, le indicamos son subset que solo borre aquellos que tengan duplicados en 'loyalty_number', 'year' y 'month'y con Keep = Last queremos que conserve la última filas de aquellas que esten duplicadas.
df_activity_clean = df_activity.drop_duplicates(subset=['loyalty_number', 'year', 'month'], keep='last')

In [15]:
df_activity_clean.duplicated().sum()

np.int64(0)

In [16]:
df_activity_clean.shape

(401688, 10)

In [17]:
# El método describe nos permite ver las estadísticas descriptivas de las variables numéricas del df
df_activity.describe().T # La 'T' cambia las filas y columnas

,count,mean,std,min,25%,50%,75%,max
loyalty_number,405624.0,550037.873084,258935.286969,100018.0,326961.00,550834.0,772194.00,999986.0
year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
flights_booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
flights_with_companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
total_flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
points_accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
points_redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
dollar_cost_points_redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

In [18]:
df_activity.isnull().sum() # Usando el método isnull junto al sum podemos ver cuantos valores nulos hay en cada columna,

loyalty_number                 0
year                           0
month                          0
flights_booked                 0
flights_with_companions        0
total_flights                  0
distance                       0
points_accumulated             0
points_redeemed                0
dollar_cost_points_redeemed    0
dtype: int64

In [19]:
df_history.head()

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [20]:
df_history.shape

(16737, 16)

In [21]:
df_history.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB

In [22]:
# Aquí podemos ver el porcentaje tan alto de nulos de cancellation year y cancellation month, puede ser un dato importante

df_history.isna().sum()/len(df_history)*100

Loyalty Number         0.000000
Country                0.000000
Province               0.000000
City                   0.000000
Postal Code            0.000000
Gender                 0.000000
Education              0.000000
Salary                25.321145
Marital Status         0.000000
Loyalty Card           0.000000
CLV                    0.000000
Enrollment Type        0.000000
Enrollment Year        0.000000
Enrollment Month       0.000000
Cancellation Year     87.650117
Cancellation Month    87.650117
dtype: float64

In [23]:
#eliminamos la columna 'Country' ya que, todos los clientes son de Canadá
df_history.drop(columns = 'Country', inplace = True)

In [24]:
change_names_history = {col:col.lower().replace(' ', '_') for col in df_history.columns}
change_names_history

{'Loyalty Number': 'loyalty_number',
 'Province': 'province',
 'City': 'city',
 'Postal Code': 'postal_code',
 'Gender': 'gender',
 'Education': 'education',
 'Salary': 'salary',
 'Marital Status': 'marital_status',
 'Loyalty Card': 'loyalty_card',
 'CLV': 'clv',
 'Enrollment Type': 'enrollment_type',
 'Enrollment Year': 'enrollment_year',
 'Enrollment Month': 'enrollment_month',
 'Cancellation Year': 'cancellation_year',
 'Cancellation Month': 'cancellation_month'}

In [25]:
# Con el método rename renombramos las columnas usando los diccionarios creados previamente
df_history.rename(columns = change_names_history, inplace = True)

In [26]:
df_history.head()

,loyalty_number,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
0,480934,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [27]:
df_history.duplicated().sum()

np.int64(0)

In [28]:
df_history.head()

,loyalty_number,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
0,480934,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [29]:
#Saco los salarios negativos

df_history[df_history["salary"] < 0]

,loyalty_number,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
1082,542976,Quebec,Montreal,H2Y 4R4,Male,High School or Below,-49830.0,Divorced,Star,24127.50,2018 Promotion,2018,3,NaN,NaN
1894,959977,British Columbia,Vancouver,V5R 1W3,Female,Bachelor,-12497.0,Married,Aurora,9453.00,2018 Promotion,2018,3,NaN,NaN
2471,232755,British Columbia,Vancouver,V1E 4R6,Female,Bachelor,-46683.0,Single,Nova,4787.81,2018 Promotion,2018,3,NaN,NaN
3575,525245,British Columbia,Victoria,V10 6T5,Male,Bachelor,-45962.0,Married,Star,2402.33,2018 Promotion,2018,3,NaN,NaN
3932,603070,British Columbia,West Vancouver,V6V 8Z3,Female,Bachelor,-19325.0,Single,Star,2893.74,2018 Promotion,2018,3,NaN,NaN
4712,491242,British Columbia,Dawson Creek,U5I 4F1,Male,Bachelor,-43234.0,Married,Star,7597.91,2018 Promotion,2018,3,NaN,NaN
6560,115505,Newfoundland,St. John's,A1C 6H9,Male,Bachelor,-10605.0,Married,Nova,5860.17,2018 Promotion,2018,4,NaN,NaN
6570,430398,Newfoundland,St. John's,A1C 6H9,Male,Bachelor,-17534.0,Married,Nova,49423.80,2018 Promotion,2018,3,NaN,NaN
7373,152016,Ontario,Toronto,P1J 8T7,Female,Bachelor,-58486.0,Married,Aurora,5067.21,2018 Promotion,2018,2,NaN,NaN
8576,194065,Ontario,Sudbury,M5V 1G5,Female,Bachelor,-31911.0,Married,Nova,2888.85,2018 Promotion,2018,2,NaN,NaN
8767,212128,Ontario,Toronto,P2T 6G3,Male,Bachelor,-49001.0,Married,Nova,3130.68,2018 Promotion,2018,2,NaN,NaN
10232,790475,Ontario,Trenton,K8V 4B2,Female,Bachelor,-34079.0,Married,Nova,12913.50,2018 Promotion,2018,2,NaN,NaN
11635,366599,Ontario,Toronto,M1R 4K3,Female,Bachelor,-9081.0,Married,Star,6915.73,2018 Promotion,2018,4,NaN,NaN
12596,436087,Quebec,Montreal,H2T 9K8,Male,Bachelor,-46470.0,Married,Star,4786.89,2018 Promotion,2018,4,2018.0,8.0
13564,364596,Quebec,Tremblant,H5Y 2S9,Female,Bachelor,-26322.0,Single,Aurora,16710.84,2018 Promotion,2018,4,2018.0,12.0
14327,239955,Quebec,Hull,J8Y 3Z5,Female,Bachelor,-47310.0,Married,Nova,6366.23,2018 Promotion,2018,3,NaN,NaN
14355,347013,Quebec,Quebec City,G1B 3L5,Male,Bachelor,-39503.0,Married,Nova,6446.71,2018 Promotion,2018,3,NaN,NaN
15416,729561,Quebec,Quebec City,G1B 3L5,Female,Bachelor,-19332.0,Divorced,Star,5308.29,2018 Promotion,2018,2,NaN,NaN
16431,734647,Saskatchewan,Regina,S1J 3C5,Male,Bachelor,-46303.0,Married,Nova,11280.73,2018 Promotion,2018,4,NaN,NaN
16735,906428,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,-57297.0,Married,Star,10018.66,2018 Promotion,2018,4,NaN,NaN

In [30]:
# Paso el salario a positivo con el método .abs, ya que puede tratarse de un error

df_history['salary'] = df_history['salary'].abs()

In [33]:
# Vamos a modificar los valores de gender pasando female a F y male a M para evitar errores de escritura a futuro
df_history['gender'] = df_history['gender'].map({'Female': "F", 'Male': 'M'})

In [34]:
#Como tienen el loyalty_number igual en los dos df, los unimos con merge a la izquierda

df_conjunto = df_history.merge(df_activity, on =["loyalty_number"], how = "left")

df_conjunto.head()

,loyalty_number,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
0,480934,Ontario,Toronto,M2Z 4K1,F,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN,2017,1,0,0,0,0,0.0,0,0
1,480934,Ontario,Toronto,M2Z 4K1,F,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN,2017,2,3,0,3,2823,282.0,0,0
2,480934,Ontario,Toronto,M2Z 4K1,F,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN,2017,3,0,0,0,0,0.0,0,0
3,480934,Ontario,Toronto,M2Z 4K1,F,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN,2017,4,0,0,0,0,0.0,0,0
4,480934,Ontario,Toronto,M2Z 4K1,F,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN,2018,10,6,2,8,3352,335.0,465,38

**LIMPIEZA DE DATOS**

In [37]:
df_conjunto.isnull().mean() * 100

loyalty_number                  0.000000
province                        0.000000
city                            0.000000
postal_code                     0.000000
gender                          0.000000
education                       0.000000
salary                         25.312112
marital_status                  0.000000
loyalty_card                    0.000000
clv                             0.000000
enrollment_type                 0.000000
enrollment_year                 0.000000
enrollment_month                0.000000
cancellation_year              87.657535
cancellation_month             87.657535
year                            0.000000
month                           0.000000
flights_booked                  0.000000
flights_with_companions         0.000000
total_flights                   0.000000
distance                        0.000000
points_accumulated              0.000000
points_redeemed                 0.000000
dollar_cost_points_redeemed     0.000000
dtype: float64

In [ ]:
#Podemos ver los detalles de los nulos, y coincide que todos los estudiantes don los que tienen NAN en el salary, lo compruebo después

df_conjunto[df_conjunto["salary"].isna()]

,loyalty_number,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
24,549612,Alberta,Edmonton,T3G 6Y6,M,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN,2017,1,9,1,10,1860,186.0,0,0
25,549612,Alberta,Edmonton,T3G 6Y6,M,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN,2017,2,9,0,9,2043,204.0,0,0
26,549612,Alberta,Edmonton,T3G 6Y6,M,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN,2017,3,14,0,14,2002,200.0,0,0
27,549612,Alberta,Edmonton,T3G 6Y6,M,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN,2017,4,0,0,0,0,0.0,0,0
28,549612,Alberta,Edmonton,T3G 6Y6,M,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN,2017,5,16,0,16,3056,305.0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
405571,776187,British Columbia,Vancouver,V5R 1W3,M,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN,2018,7,4,4,8,3640,364.0,0,0
405572,776187,British Columbia,Vancouver,V5R 1W3,M,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN,2018,8,6,0,6,1890,189.0,0,0
405573,776187,British Columbia,Vancouver,V5R 1W3,M,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN,2018,9,0,0,0,0,0.0,0,0
405574,776187,British Columbia,Vancouver,V5R 1W3,M,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN,2018,11,11,0,11,2552,255.0,0,0
405575,776187,British Columbia,Vancouver,V5R 1W3,M,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN,2018,12,16,0,16,3536,353.0,0,0

In [38]:
# Primero, filtramos el DataFrame para obtener solo las filas donde 'Education' es 'College'

df_conjunto[df_conjunto.education == 'College'].salary.isnull().sum()

np.int64(102672)

In [ ]:
# Podemos ver que coinciden 

df_conjunto.salary.isnull().sum()

np.int64(102672)

In [40]:
df_conjunto.describe().T

,count,mean,std,min,25%,50%,75%,max
loyalty_number,405624.0,550037.873084,258935.286969,100018.00,326961.00,550834.00,772194.00,999986.00
salary,302952.0,79381.440228,34735.904533,9081.00,59262.00,73479.00,88612.00,407228.00
clv,405624.0,7991.976226,6863.663857,1898.01,3985.32,5776.34,8936.82,83325.38
enrollment_year,405624.0,2015.252529,1.979427,2012.00,2014.00,2015.00,2017.00,2018.00
enrollment_month,405624.0,6.668008,3.399766,1.00,4.00,7.00,10.00,12.00
cancellation_year,50064.0,2016.499521,1.384336,2013.00,2016.00,2017.00,2018.00,2018.00
cancellation_month,50064.0,6.966443,3.448300,1.00,4.00,7.00,10.00,12.00
year,405624.0,2017.500000,0.500001,2017.00,2017.00,2017.50,2018.00,2018.00
month,405624.0,6.500000,3.452057,1.00,3.75,6.50,9.25,12.00
flights_booked,405624.0,4.115052,5.225518,0.00,0.00,1.00,8.00,21.00
flights_with_companions,405624.0,1.031805,2.076869,0.00,0.00,0.00,1.00,11.00
total_flights,405624.0,5.146858,6.521227,0.00,0.00,1.00,10.00,32.00
distance,405624.0,1208.880059,1433.155320,0.00,0.00,488.00,2336.00,6293.00
points_accumulated,405624.0,123.692721,146.599831,0.00,0.00,50.00,239.00,676.50
points_redeemed,405624.0,30.696872,125.486049,0.00,0.00,0.00,0.00,876.00
dollar_cost_points_redeemed,405624.0,2.484503,10.150038,0.00,0.00,0.00,0.00,71.00